# Languages
brew 'ruby-build'
brew 'asdf'

# Text editing
brew 'editorconfig'
brew 'neovim'
brew 'ctags'
brew 'the_silver_searcher'
brew 'html5-tidy'

# Shell environment
brew 'zsh'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'tmux'
brew 'tree'
brew 'highlight'
brew 'ssh-copy-id'
brew 'fzf'

# Dotfiles utilities
tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/rcm'

# Networking
brew 'curl'
brew 'ncdu'
brew 'netcat'
brew 'openssl'
brew 'wget'

# Databases
brew 'postgresql'

# Testing
brew 'shellcheck'

# Ops
brew 'awscli'
brew 'cf'

# Version control
brew 'git'
brew 'diff-so-fancy'
brew 'tig'

# Usefuls
brew 'htop'
brew 'cmake'
brew 'pidof'
brew 'graphviz'

# Desktop software
cask 'google-chrome'
cask 'dropbox'
cask '1password'
cask 'hammerspoon'
cask 'alacritty'
cask 'spotify'
cask 'postman'
cask 'zoom'
cask 'microsoft-teams'
