# Languages
brew 'rbenv'
brew 'ruby-build'
brew 'node'

# Text editing
tap  'd12frosted/emacs-plus'
brew 'd12frosted/emacs-plus/emacs-plus'
brew 'editorconfig'
brew 'neovim'
brew 'ctags'
brew 'the_silver_searcher'

# Shell environment
brew 'zsh'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'tmux'
brew 'z'
brew 'tree'
brew 'highlight'
brew 'ranger'
brew 'ssh-copy-id'
brew 'fzf'

# Dotfiles utilities
tap 'thoughtbot/formulae'
brew 'thoughtbot/formulae/rcm'

# Networking
brew 'curl'
brew 'ncdu'
brew 'netcat'
brew 'openssl'
brew 'wget'

# Testing
brew 'phantomjs'
brew 'shellcheck'

# Ops
brew 'awscli'

# Version control
brew 'git'
brew 'hub'
brew 'diff-so-fancy'
brew 'tig'

# Usefuls
brew 'htop'
brew 'cmake'
brew 'pidof'

# Desktop software
cask 'google-chrome'
cask 'iterm2'
cask 'dropbox'
cask '1password'
cask 'hammerspoon'



